"""
for循环格式如下   x:起始值默认0    y:结束值(不含)   z:步长默认1
for 临时变量 in range(x,y,z):
    循环体


while循环格式如下
while 条件:
    循环体
while注意->条件如果恒成立就是死循环
"""
# 需求1: 循环依次打印1-5
for i in range(1, 6, 1):
    print(i)
print('------------------------------')

j = 1
while j < 6:
    print(j)
    j += 1
print('=================================')
# 需求2: 循环依次打印1,3,5
for i in range(1, 6, 2):
    print(i)
print('------------------------------')

j = 1
while j < 6:
    print(j)
    j += 2
print('=================================')