"""序列"""
"""
序列: 支持索引的字符串,列表,元组
支持索引:
    正索引:从0开始,从左到右依次递增
    负索引:从-1开始,从右到左依次递减
序列支持切片功能
格式如下
    序列名[x:y:z]
    x->开始位置(含本身),如果不写默认是开头 0 或者 -1
    y->结束位置(不含本身),如果不写默认是结尾
    z->默认是1
        注意:z步长为正代表开头是0,步长为负代表开头是-1
"""
# 定义字符串
s1 = 'abcde'
# 定义列表
l1 = ['a', 'b', 'c', 'd', 'e']
# 定义元组
t1 = ('a', 'b', 'c', 'd', 'e')
# 打印原始数据
print(s1)
print(l1)
print(t1)
print(s1[::])
print(l1[::])
print(t1[::])
print('=======================')
# 需求: 截取出 abc
print(s1[0:3:1])
print(l1[0:3:1])
print(t1[0:3:1])
# 需求: 截取出 ace
print(s1[0::2])
print(l1[0::2])
print(t1[0::2])
# 需求: 截取出 edcba
print(s1[::-1])
print(l1[::-1])
print(t1[::-1])